In [179]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings("ignore")

df kopyalamak çok önemli bunu data setini okuyunca hemen yap. İlerde orjinal data kesin lazım olacak

# Creating a New Column

In [180]:
data = {"isim": ["ali", "elif", "fatma", "mehmet"], "boy": [1.70, 1.55, 1.60, 1.90], "kilo": [70,55,60,80]}
df = pd.DataFrame(data)
df

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [181]:
df["vki"] = round((df["kilo"] / df["boy"] ** 2), 2)

In [182]:
df

     isim   boy  kilo    vki
0     ali  1.70    70  24.22
1    elif  1.55    55  22.89
2   fatma  1.60    60  23.44
3  mehmet  1.90    80  22.16

# Conditional Selection

In [183]:
df = pd.DataFrame(np.random.randn(5,4), index="a b c d e".split(), columns=["A", "B", "C", "D"])
df

          A         B         C         D
a  0.563726 -0.813416  0.479610  0.091183
b  1.286620 -1.432703 -0.997518 -0.303368
c  0.275435 -1.141430  0.520777  0.362851
d  0.067063 -0.148924 -0.273569 -0.471801
e -0.327178  0.577582  0.411204 -0.615110

In [184]:
df > 0

       A      B      C      D
a   True  False   True   True
b   True  False  False  False
c   True  False   True   True
d   True  False  False  False
e  False   True   True  False

In [185]:
df[df > 0]

          A         B         C         D
a  0.563726       NaN  0.479610  0.091183
b  1.286620       NaN       NaN       NaN
c  0.275435       NaN  0.520777  0.362851
d  0.067063       NaN       NaN       NaN
e       NaN  0.577582  0.411204       NaN

In [186]:
df[df < 0]

          A         B         C         D
a       NaN -0.813416       NaN       NaN
b       NaN -1.432703 -0.997518 -0.303368
c       NaN -1.141430       NaN       NaN
d       NaN -0.148924 -0.273569 -0.471801
e -0.327178       NaN       NaN -0.615110

In [187]:
df[df["A"] < 0] # A da 0 dan küçükleri döndürdü diğerlerinin değeri önemli olmadı

          A         B         C        D
e -0.327178  0.577582  0.411204 -0.61511

In [188]:
df[df["A"] > 0][["C"]] # # A da 0 dan büyük olan satırların C değerlerini döndürdü

          C
a  0.479610
b -0.997518
c  0.520777
d -0.273569

In [189]:
df

          A         B         C         D
a  0.563726 -0.813416  0.479610  0.091183
b  1.286620 -1.432703 -0.997518 -0.303368
c  0.275435 -1.141430  0.520777  0.362851
d  0.067063 -0.148924 -0.273569 -0.471801
e -0.327178  0.577582  0.411204 -0.615110

## &   -   and 
## |   -   or

In [190]:
df[(df["A"] > 0)  &  (df["B"] < 0)] # A da 0 dan büyük olacak ve B de 0 dan küçük olacak. ikisi aynı anda olmalı

          A         B         C         D
a  0.563726 -0.813416  0.479610  0.091183
b  1.286620 -1.432703 -0.997518 -0.303368
c  0.275435 -1.141430  0.520777  0.362851
d  0.067063 -0.148924 -0.273569 -0.471801

In [191]:
df[(df["A"] > 0) | (df["B"] < 0)] # A da 0 büyük veya B de 0 dan küçük olanlar

          A         B         C         D
a  0.563726 -0.813416  0.479610  0.091183
b  1.286620 -1.432703 -0.997518 -0.303368
c  0.275435 -1.141430  0.520777  0.362851
d  0.067063 -0.148924 -0.273569 -0.471801

# Some Useful Methods with Titanic Dataset

In [192]:
import seaborn as sns

In [193]:
print(sns.get_dataset_names()) # seaborn'da gömülü dataframeler

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [194]:
df = sns.load_dataset("titanic")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

## df.info()  & df.head() & df.tail() & df.sample()

In [195]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [196]:
df.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [197]:
df.head(5) # deafault ilk 5 satır

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [198]:
df.tail(5) # default olarak son 5 satır

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [199]:
df.sample(3) # rastgele 3 satır getirir

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
848,0,2,male,28.0,0,1,33.000,S,Second,man,True,NaN,Southampton,no,False
560,0,3,male,NaN,0,0,7.750,Q,Third,man,True,NaN,Queenstown,no,True
129,0,3,male,45.0,0,0,6.975,S,Third,man,True,NaN,Southampton,no,True

In [200]:
df.shape

(891, 15)

## df.describe()
Count: Her sütundaki non-null (null olmayan) değerlerin sayısını verir.

Mean: Ortalama (aritmetik ortalama) değeri verir.

Standard Deviation: Standart sapmayı verir, yani değerlerin ortalama etrafındaki yayılımını gösteren bir ölçüdür.

Minimum: En küçük değeri verir.

25th Percentile: Alt çeyrek yüzdeğini verir, yani değerlerin %25'lik kısmının altında kalan değeri verir.

Median (50th Percentile): Medyan değeri verir, yani değerlerin ortanca değerini verir.

75th Percentile: Üst çeyrek yüzdeğini verir, yani değerlerin %75'lik kısmının altında kalan değeri verir.

Maximum: En büyük değeri verir.

Unique: Benzersiz (farklı) değerlerin sayısını verir.

Top: En sık tekrar eden değeri verir.

Frequency: En sık tekrar eden değerin kaç kez tekrar ettiğini verir.

In [201]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [202]:
df.describe().transpose()

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [203]:
df.describe().T #transpose() kısaltma

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [204]:
df.describe(include="O").T # sadece object olanların ölçümlerini getirdi

            count unique          top freq
sex           891      2         male  577
embarked      889      3            S  644
who           891      3          man  537
embark_town   889      3  Southampton  644
alive         891      2           no  549

In [205]:
df.describe(include="all").T # bütün verileri getirdi

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
survived,891.0,NaN,NaN,NaN,0.383838,0.486592,0.0,0.0,0.0,1.0,1.0
pclass,891.0,NaN,NaN,NaN,2.308642,0.836071,1.0,2.0,3.0,3.0,3.0
sex,891,2,male,577,NaN,NaN,NaN,NaN,NaN,NaN,NaN
age,714.0,NaN,NaN,NaN,29.699118,14.526497,0.42,20.125,28.0,38.0,80.0
sibsp,891.0,NaN,NaN,NaN,0.523008,1.102743,0.0,0.0,0.0,1.0,8.0
parch,891.0,NaN,NaN,NaN,0.381594,0.806057,0.0,0.0,0.0,0.0,6.0
fare,891.0,NaN,NaN,NaN,32.204208,49.693429,0.0,7.9104,14.4542,31.0,512.3292
embarked,889,3,S,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN
class,891,3,Third,491,NaN,NaN,NaN,NaN,NaN,NaN,NaN
who,891,3,man,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN
adult_male,891,2,True,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN
deck,203,7,C,59,NaN,NaN,NaN,NaN,NaN,NaN,NaN
embark_town,889,3,Southampton,644,NaN,NaN,NaN,NaN,NaN,NaN,NaN
alive,891,2,no,549,NaN,NaN,NaN,NaN,NaN,NaN,NaN
alone,891,2,True,537,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## df.corr()
"df.corr()" kodu, bir Pandas veri çerçevesinde bulunan sayısal sütunlar arasındaki Pearson korelasyon katsayılarını hesaplayan bir metoddur. Pearson korelasyonu, iki sürekli değişken arasındaki doğrusal ilişkiyi ölçen bir istatistiksel metriktir. Korelasyon katsayısı -1 ile 1 arasında bir değer alabilir ve iki değişken arasındaki ilişkinin yönünü (pozitif, negatif veya ilişkisiz) ve gücünü ifade eder.

"Df.corr()" kodu, veri çerçevesinde bulunan sayısal sütunlar arasındaki Pearson korelasyon katsayılarını bir korelasyon matrisi olarak döndürür. Korelasyon matrisi, veri çerçevesindeki her bir sayısal sütunun diğer sayısal sütunlarla olan korelasyonunu gösterir. Matrisin iki boyutlu yapısı, satır ve sütunlar arasındaki korelasyonu temsil eder. Matrisin çapraz köşeleri genellikle aynı sütunlar arasındaki korelasyonlar olup, diagonali ise sütunların kendi kendine korelasyonlarını içerir.

"Df.corr()" metodu, veri analitiği, keşifsel veri analitiği ve makine öğrenimi modellerinde değişkenler arasındaki ilişkileri değerlendirmek, çoklu değişken analizleri yapmak, özellik seçimi yapmak gibi birçok uygulamada kullanılabilir. Korelasyon katsayıları, değişkenler arasındaki ilişkileri anlamak ve modelleme süreçlerinde daha iyi kararlar vermek için değerli bir araçtır.

In [206]:
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [207]:
import warnings

warnings.filterwarnings("ignore") # bu tür uyarıları görmemek için

In [208]:
df.corr()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

## .value_counts()
 bir sütundaki benzersiz değerlerin sayısını ve her bir değerin kaç kez tekrar ettiğini hesaplayan yada oranlarını görebiliriz

In [209]:
df.loc[:,"survived"]

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [210]:
df.survived.value_counts() # bü sütunda 0 ve 1 değerleri var ve kaç kere tekrar ettikleri

0    549
1    342
Name: survived, dtype: int64

In [211]:
df.survived.value_counts(normalize=True) # # bü sütunda 0 ve 1 değerleri var ve oranları

0    0.616162
1    0.383838
Name: survived, dtype: float64

## .unique() & .nunique()

In [212]:
df.embark_town.unique() # bü sütundaki unique değerleri gördük

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [213]:
df.survived.unique()

array([0, 1], dtype=int64)

In [214]:
df.embark_town.nunique() # bu sütundaki unique değerlerin sayısı

3

## .sort_values()

In [215]:
df.notnull().sum().sort_values(ascending=False)

survived       891
pclass         891
sex            891
sibsp          891
parch          891
fare           891
class          891
who            891
adult_male     891
alive          891
alone          891
embarked       889
embark_town    889
age            714
deck           203
dtype: int64

## .nsmallest() & .nlargest(()

## argmax() & argmin()

## .isin()

# drop()
drop() yöntemi, bir Pandas DataFrame'den belirtilen satır veya sütunu kaldırmak için kullanılır. 

Eğer sütun kaldırılacaksa, axis='columns' parametresi kullanılır ve belirtilen sütun kaldırılır. 

Benzer şekilde, eğer bir satır kaldırılacaksa, axis='index' parametresi kullanılır ve belirtilen satır kaldırılır.

Bu yöntem, DataFrame'den istenmeyen verileri kaldırmak ve veri manipülasyonu yapmak için sıkça kullanılır.

In [216]:
data = {"isim": ["ali", "elif", "fatma", "mehmet"], "boy": [1.70, 1.55, 1.60, 1.90], "kilo": [70,55,60,80]}
df = pd.DataFrame(data)
df["vki"] = round((df["kilo"] / df["boy"] ** 2), 2)

In [217]:
df

     isim   boy  kilo    vki
0     ali  1.70    70  24.22
1    elif  1.55    55  22.89
2   fatma  1.60    60  23.44
3  mehmet  1.90    80  22.16

In [218]:
df.drop("vki", axis=1) #kalıcı olarak düşmez

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [219]:
df.drop("vki", axis=1, inplace=True) #kalıcı olarak düştü
df

     isim   boy  kilo
0     ali  1.70    70
1    elif  1.55    55
2   fatma  1.60    60
3  mehmet  1.90    80

In [220]:
df.drop(3) # default axis = 0 dır

    isim   boy  kilo
0    ali  1.70    70
1   elif  1.55    55
2  fatma  1.60    60

# .loc[] & .iloc[]
loc: label-based

iloc: integer position-based

loc, "location"ın kısaltmasıdır ve satır ve sütun adlarına göre veriye erişmeyi sağlar.

loc, satır ve sütun etiketleri kullanarak belirli bir konumda bulunan veriye erişmek için kullanılır.

iloc, "integer location"ın kısaltmasıdır ve satır ve sütun numaralarına göre veriye erişmeyi sağlar.

iloc, satır ve sütun numaralarını kullanarak belirli bir konumda bulunan veriye erişmek için kullanılır.

1- Etiket veya dizin bağımsızlığı:Geleneksel indexleme yöntemleri, indekslerdeki değişikliklerden etkilenirken, "loc" ve "iloc" yöntemleri, konumlarına göre seçim yaparlar. Bu nedenle, veri setindeki indekslerdeki değişiklikler "loc" ve "iloc" yöntemleriyle yapılan seçimlerde bir sorun yaratmaz.

2-Hızlı performans: "iloc" fonksiyonu, sadece satır ve sütun dizinleri kullanarak veri seçimi yapar, bu nedenle loc fonksiyonuna göre daha hızlı çalışır. Bu özellik, büyük veri kümelerinde veya performans açısından kritik uygulamalarda faydalıdır.

3-Esneklik: Geleneksel indexleme yöntemleri, sadece sıfırdan başlayan, ardışık tam sayılar kullanarak indexlemeye izin verir. "loc" ve "iloc" yöntemleri ise etiket veya dizin değerlerine dayanır ve daha esnek bir seçim yapma imkanı sağlar. "loc" ve "iloc" fonksiyonları, veri çerçevesindeki satır ve sütunların bir arada kullanımına izin verir. Örneğin, belirli bir sütunda belirli bir satırdaki veriyi seçmek için hem satır hem de sütun etiketlerini veya dizinlerini kullanabilirsiniz. Bu esneklik, veri işleme işlemlerinde kullanışlıdır.

4-Daha okunaklı kod: "loc" ve "iloc" fonksiyonları, kodun daha okunaklı hale gelmesine yardımcı olur.

In [221]:
data = np.arange(20).reshape(5,4)

df = pd.DataFrame(data=data, columns=["col1", "col2", "col3", "col4"], index=range(1,6))

df

   col1  col2  col3  col4
1     0     1     2     3
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [222]:
df.loc[[1]] # label isimlerine göre getirir

   col1  col2  col3  col4
1     0     1     2     3

In [223]:
df.iloc[[0]] # index lere göre getirir

   col1  col2  col3  col4
1     0     1     2     3

In [224]:
df[["col1"]]

   col1
1     0
2     4
3     8
4    12
5    16

In [225]:
df.iloc[: , 0]

1     0
2     4
3     8
4    12
5    16
Name: col1, dtype: int32

In [226]:
df.loc[2:5]

   col1  col2  col3  col4
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [227]:
df.iloc[2:5]

   col1  col2  col3  col4
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [228]:
df.index = "a b c d e".split()   # ["a", "b", "c", "d", "e"]

In [229]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [230]:
df.loc["b": "d"]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [231]:
df.iloc[1:4]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [232]:
df.loc[["b"], ["col2"]]

   col2
b     5

In [233]:
df.iloc[[1], [1]]

   col2
b     5

In [234]:
df.loc["d": "e"]["col3"]

d    14
e    18
Name: col3, dtype: int32

In [235]:
df.loc["d": "e", ["col3"]]

   col3
d    14
e    18

In [236]:
df.loc[["a", "d", "e"], ["col3"]]

   col3
a     2
d    14
e    18

# reset_index()   &  set_index
reset_index(), DataFrame indeksini sıfırlar ve bunun yerine default hali kullanır.

set_index(), DataFrame'in belirtilen bir sütununu veya sütunlarını, DataFrame'in yeni bir indeksi olarak ayarlar.

In [237]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [238]:
df.reset_index() # kalıcı olmaz ve eski indeksleri saklar

  index  col1  col2  col3  col4
0     a     0     1     2     3
1     b     4     5     6     7
2     c     8     9    10    11
3     d    12    13    14    15
4     e    16    17    18    19

In [239]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [240]:
df.reset_index(drop=True, inplace=True) # eski indeksleri düşürdük ve bu işlemi kalıcı hale getirdik

In [241]:
df

   col1  col2  col3  col4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19

In [242]:
df.set_index("col1") # kalıcı olmaz

      col2  col3  col4
col1
0        1     2     3
4        5     6     7
8        9    10    11
12      13    14    15
16      17    18    19

In [243]:
df

   col1  col2  col3  col4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19

In [244]:
df.set_index("col1", inplace=True) # kalıcı hale geldi
df

      col2  col3  col4
col1
0        1     2     3
4        5     6     7
8        9    10    11
12      13    14    15
16      17    18    19

In [245]:
df.reset_index(inplace=True)
df

   col1  col2  col3  col4
0     0     1     2     3
1     4     5     6     7
2     8     9    10    11
3    12    13    14    15
4    16    17    18    19

In [246]:
df = df[["col2", "col3", "col1", "col4"]] # tekrar colum isimlerini sıralamak için böyle bir yöntem izledik
df

   col2  col3  col1  col4
0     1     2     0     3
1     5     6     4     7
2     9    10     8    11
3    13    14    12    15
4    17    18    16    19

# df.agg() & agg methods
aggregate() & agg(); bir sütuna veya sütunlara göre gruplandırılmış bir veri kümesinde farklı işlevlerin (örneğin, mean, sum, max) uygulanması için kullanılır.

[aggregate](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.aggregate.html),
[agg](https://pandas.pydata.org/pandas-docs/version/0.23/generated/pandas.core.groupby.DataFrameGroupBy.agg.html),
[SOURCE01](https://www.shanelynn.ie/summarising-aggregation-and-grouping-data-in-python-pandas/),
[SOURCE02](https://www.analyticsvidhya.com/blog/2020/03/groupby-pandas-aggregating-data-python/)

Pandas'ın aggregation yöntemleri, belirli bir veri kümesi üzerinde işlemler gerçekleştirerek bir sonuç döndürür. 

Bu yöntemler, bir veri kümesindeki değerleri toplama, ortalama alma, en büyük veya en küçük değeri bulma gibi farklı işlemleri gerçekleştirir. 


Pandas'ın aggregation yöntemlerinden bazıları şunlardır:

**sum():** Belirtilen sütunda yer alan tüm değerlerin toplamını döndürür.

**mean():** Belirtilen sütunda yer alan tüm değerlerin ortalamasını döndürür.

**median():** Gruplanmış verilerin medyanını hesaplar.

**mode()** Belirtilen sütunda en çok tekrar eden değerleri döndürür.

**max():** Belirtilen sütunda yer alan en büyük değeri döndürür.

**min():** Belirtilen sütunda yer alan en küçük değeri döndürür.

**count():** Belirtilen sütunda yer alan toplam değer sayısını döndürür.

**std():** Belirtilen sütunda yer alan değerlerin standart sapmasını döndürür.

**var():** Belirtilen sütunda yer alan değerlerin varyansını döndürür.

**describe():** Gruplanmış verilerin istatistiksel özetini hesaplar.

**idxmin():** Belirtilen eksen boyunca minimum değeri içeren ilk indeksi döndürür.

**idxmax():** Belirtilen eksen boyunca maksimum değeri içeren ilk indeksi döndürür.

**corr():** Sütunlar  arasındaki korelasyonu, NA/null değerleri hariç tutarak hesaplar.

Bu yöntemler, bir DataFrame veya Series üzerinde kullanılabilir ve istenilen sütun veya satırlarda işlem yapılabilir. 

Pandas'ın aggregation yöntemleri, verileri hızlı ve etkili bir şekilde analiz etmek için çok kullanışlıdır.

[Pandas Official Documentation](https://pandas.pydata.org/docs/reference/frame.html)

In [247]:
dt = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Ece', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Sales':[180, 160, 150, 180, 240, 200, 220, 160]}

df = pd.DataFrame(dt)
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [248]:
df.agg([sum, min])

,Company,Department,Person,Age,Sales
sum,AmazonAmazonOpenAIOpenAIAmazonOpenAIAmazonOpenAI,ITHRITHRITHRHRIT,AhmetEceFatmaMehmetZeynepAliYusufElif,254,1490
min,Amazon,HR,Ahmet,25,150

In [249]:
df.loc[:, ["Age", "Sales"]].agg([sum]) # belirli sütunlara uyguladım

     Age  Sales
sum  254   1490

In [250]:
df.agg({"Age": sum, "Sales" : [min]}) # sütunlara ayrı ayrı işlemler atadık

       Age  Sales
sum  254.0    NaN
min    NaN  150.0

In [251]:
df.agg({"Age": [sum, np.mean], "Sales" : [min, max]})

         Age  Sales
sum   254.00    NaN
mean   31.75    NaN
min      NaN  150.0
max      NaN  240.0

In [252]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [253]:
df.Sales.min()

150

In [254]:
df.Sales.idxmax() # max Sales olanın indexisini döndürdü

4

In [255]:
df.Sales.idxmin() # min Sales olanın indexisini döndürdü

2

# .groupby()
groupby(); bir veri setindeki belirli bir sütuna göre gruplama yapmak için kullanılır ve aggregation metodlarıyla beraber kullanılır

Bu işlev, verileri gruplara ayırmak ve bu gruplar üzerinde çeşitli işlemler yapmak için kullanılır.

Örneğin, bir veri kümesinde müşterilerin isimleri, yaşları ve satın aldıkları ürünler yer alıyor olabilir. groupby() işlevi kullanarak, müşterilerin satın aldıkları ürüne göre gruplandırabilir ve her ürün için ortalama yaşlarını bulabilirsiniz.

[Source01](https://towardsdatascience.com/all-pandas-groupby-you-should-know-for-grouping-data-and-performing-operations-2a8ec1327b5),
[Source02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html),
[Source03](https://naomi-fridman.medium.com/pandas-groupby-explained-with-titanic-6a1c47eb8182)

In [256]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [257]:
df.groupby("Company") # bu şekilde object döndürür. bir işlem uygulamadık

In [258]:
df.groupby("Company").mean() # gruplayıp, grup ortalamalarına baktık. sadece numeric satırlara uyguladı

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [259]:
df.groupby("Company")[["Sales"]].mean() #sadece Sales sütununa uyguladık

         Sales
Company
Amazon   200.0
OpenAI   172.5

In [260]:
df.groupby("Company").count()

         Department  Person  Age  Sales
Company
Amazon            4       4    4      4
OpenAI            4       4    4      4

In [261]:
df.groupby("Company")[["Company"]].count()

         Company
Company
Amazon         4
OpenAI         4

In [262]:
df.Company.value_counts()

Amazon    4
OpenAI    4
Name: Company, dtype: int64

In [263]:
df.groupby(["Company", "Department"]).mean()

                     Age  Sales
Company Department
Amazon  HR          28.0  190.0
        IT          28.5  210.0
OpenAI  HR          39.0  190.0
        IT          31.5  155.0

In [264]:
# Bölümlere (departmanlara) göre toplam sales tutarlarını hesaplamak:

df.groupby('Department').sum()[['Sales']]

            Sales
Department
HR            760
IT            730

In [265]:
compare = df.groupby(["Company"]) # bir değişkene atayabiliriz

In [266]:
compare.mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [267]:
compare.corr()

                    Age     Sales
Company
Amazon  Age    1.000000 -0.221032
        Sales -0.221032  1.000000
OpenAI  Age    1.000000  0.593934
        Sales  0.593934  1.000000

# filter()
filter(): Verileri belirli bir koşula göre filtreler.

belirli bir koşulu karşılayan satırları veya sütunları seçmek için kullanılabilir.

Parametreler: df.filter(items=None, like=None, regex=None, axis=None)

items: Bir liste veya dizin nesnesi olarak belirtilen sütun adlarını içeren bir liste. Sadece bu sütunlar seçilir.

like: String olarak belirtilen bir deseni içeren sütun adları seçilir.

regex: Regex (düzenli ifade) olarak belirtilen bir deseni içeren sütun adları seçilir.

axis: 'columns' veya 1 olarak belirtilirse sütunlarda filtreleme yapar, 'index' veya 0 olarak belirtilirse satırlarda filtreleme yapar.

[Pandas Official Documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.filter.html),
[SOURCE01](https://www.sharpsightlabs.com/blog/pandas-filter/),
[SOURCE02](https://appdividend.com/2020/03/19/pandas-filter-pandas-dataframe-filter-in-python-example/)

In [268]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [269]:
df.filter(['Company', 'Age'])

  Company  Age
0  Amazon   32
1  Amazon   26
2  OpenAI   35
3  OpenAI   40
4  Amazon   25
5  OpenAI   38
6  Amazon   30
7  OpenAI   28

In [270]:
df.filter(like='a') # sütun adlarından "a" kelimesini içeren sütunlar seçilecektir.

  Company Department  Sales
0  Amazon         IT    180
1  Amazon         HR    160
2  OpenAI         IT    150
3  OpenAI         HR    180
4  Amazon         IT    240
5  OpenAI         HR    200
6  Amazon         HR    220
7  OpenAI         IT    160

In [271]:
df.filter(regex='^C') # Bu örnekte sütun adlarından "C" harfi ile başlayan sütunlar seçilecektir.

  Company
0  Amazon
1  Amazon
2  OpenAI
3  OpenAI
4  Amazon
5  OpenAI
6  Amazon
7  OpenAI

In [272]:
df.filter(like="3", axis=0)

  Company Department  Person  Age  Sales
3  OpenAI         HR  Mehmet   40    180

## groupby - filter

In [273]:
df.groupby("Company").mean()

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [274]:
df.groupby("Company").filter(lambda x : x["Age"].mean() < 30) 
# grup yaş ortalaması 30 un altında ise True olur ve o değerler döner

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
4  Amazon         IT  Zeynep   25    240
6  Amazon         HR   Yusuf   30    220

In [275]:
(lambda x : x["Age"].mean() < 30)(df.groupby("Company"))

Company
Amazon     True
OpenAI    False
Name: Age, dtype: bool

# transform()

DataFrame veya Series nesnelerinde gruplama işlemleri sonrası verileri dönüştürmek için kullanılan bir fonksiyondur. "transform()" fonksiyonu, her bir grup için aynı boyutta bir sonuç üretir ve orijinal veri yapısını korur. Gruplanmış veri üzerinde herhangi bir işlem yapabilir ve sonuçları orijinal veri yapısına uygun bir şekilde dönüştürebilir.

transform(), bir pandas DataFrame ya da Serisi'ndeki verileri değiştirmek veya dönüştürmek için kullanılan bir yöntemdir. 

Belirtilen işlevi uygular ve sonucu yeni bir Seri veya DataFrame olarak döndürür.

Özellikle gruplama işlemleri ile birlikte kullanıldığında oldukça yararlıdır.

agg. metodlarla kullanılabilir

[SOUREC01](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.transform.html) & [SOURCE02](https://www.analyticsvidhya.com/blog/2020/03/understanding-transform-function-python/)

In [276]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [277]:
df_num = df.iloc[:, 3:]

In [278]:
df_num

   Age  Sales
0   32    180
1   26    160
2   35    150
3   40    180
4   25    240
5   38    200
6   30    220
7   28    160

In [279]:
df_num.Sales.transform(np.sqrt)

0    13.416408
1    12.649111
2    12.247449
3    13.416408
4    15.491933
5    14.142136
6    14.832397
7    12.649111
Name: Sales, dtype: float64

In [280]:
df_num.Sales.agg(np.sqrt)

0    13.416408
1    12.649111
2    12.247449
3    13.416408
4    15.491933
5    14.142136
6    14.832397
7    12.649111
Name: Sales, dtype: float64

## groupby - transform

In [281]:
df.groupby("Company")["Age"].mean()

Company
Amazon    28.25
OpenAI    35.25
Name: Age, dtype: float64

In [282]:
df.groupby("Company")[["Age"]].transform(np.mean) # her satıra grubunun ortalamasını yazdı

     Age
0  28.25
1  28.25
2  35.25
3  35.25
4  28.25
5  35.25
6  28.25
7  35.25

# apply() - applymap() - map()

apply(): DataFrame veya Seri üzerinde bir satır veya sütun boyunca bir işlem yapmak için kullanılır.

applymap(): DataFrame'in tamamı üzerinde öğe bazında işlem için kullanılır.her hücreye teker teker uygular

map(): Yalnızca Seri lerde kullanılabilir ve Seri nin her bir elemanına uygulanacak bir işlem için kullanılır.

[apply](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.apply.html)
[applymap](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.applymap.html)
[map](https://pandas.pydata.org/docs/reference/api/pandas.Series.map.html)

[SOUREC01](https://www.geeksforgeeks.org/python-pandas-apply/), 
[SOURCE02](https://www.datacamp.com/community/tutorials/pandas-apply),
[SOURCE03](https://sparkbyexamples.com/pandas/pandas-apply-function-usage-examples/),
[SOURCE04](https://realpython.com/python-map-function/#:~:text=Python's%20map()%20is%20a,them%20into%20a%20new%20iterable.),
[SOURCE05](https://www.w3resource.com/pandas/series/series-map.php),
[SOURCE06](https://towardsdatascience.com/introduction-to-pandas-apply-applymap-and-map-5d3e044e93ff#:~:text=apply()%20is%20used%20to,a%20Series%20with%20another%20value.),
[SOURCE07](https://stackoverflow.com/questions/19798153/difference-between-map-applymap-and-apply-methods-in-pandas) &
[SOURCE08](https://medium.com/@akaivdo/how-to-use-map-apply-applymap-methods-in-pandas-ddde5f2140bd)

In [283]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [284]:
df[["Company", "Person"]].applymap(lambda x: x.upper()) # bütun satırlara tek tek işlem yaptı

  Company  Person
0  AMAZON   AHMET
1  AMAZON     ECE
2  OPENAI   FATMA
3  OPENAI  MEHMET
4  AMAZON  ZEYNEP
5  OPENAI     ALI
6  AMAZON   YUSUF
7  OPENAI    ELIF

In [285]:
df["Company"].map(lambda x: x.upper()) # map sadece Serieslerle çalışır.

0    AMAZON
1    AMAZON
2    OPENAI
3    OPENAI
4    AMAZON
5    OPENAI
6    AMAZON
7    OPENAI
Name: Company, dtype: object

In [286]:
df.Age.map(lambda x: x + 10) # bütün yaşlara 10 ekledi

0    42
1    36
2    45
3    50
4    35
5    48
6    40
7    38
Name: Age, dtype: int64

In [287]:
data = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Ece', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Sales':[180, 160, 150, 180, 240, 200, 220, 160]}

df = pd.DataFrame(data)
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [288]:
df_num = df.iloc[:, 3:]
df_num

   Age  Sales
0   32    180
1   26    160
2   35    150
3   40    180
4   25    240
5   38    200
6   30    220
7   28    160

In [289]:
df_num.applymap(lambda x: x * 10)

   Age  Sales
0  320   1800
1  260   1600
2  350   1500
3  400   1800
4  250   2400
5  380   2000
6  300   2200
7  280   1600

In [290]:
df_num.transform(lambda x: x * 10)

   Age  Sales
0  320   1800
1  260   1600
2  350   1500
3  400   1800
4  250   2400
5  380   2000
6  300   2200
7  280   1600

In [291]:
df_num.Age.map(lambda x: x * 10)

0    320
1    260
2    350
3    400
4    250
5    380
6    300
7    280
Name: Age, dtype: int64

In [292]:
df_num.Age.apply(lambda x: x * 10)

0    320
1    260
2    350
3    400
4    250
5    380
6    300
7    280
Name: Age, dtype: int64

In [293]:
df_num.apply(lambda x: x * 10)

   Age  Sales
0  320   1800
1  260   1600
2  350   1500
3  400   1800
4  250   2400
5  380   2000
6  300   2200
7  280   1600

In [294]:
df.groupby("Company")["Age"].transform("mean")

0    28.25
1    28.25
2    35.25
3    35.25
4    28.25
5    35.25
6    28.25
7    35.25
Name: Age, dtype: float64

In [295]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [296]:
df.applymap(lambda x: len(str(x)))

   Company  Department  Person  Age  Sales
0        6           2       5    2      3
1        6           2       3    2      3
2        6           2       5    2      3
3        6           2       6    2      3
4        6           2       6    2      3
5        6           2       3    2      3
6        6           2       5    2      3
7        6           2       4    2      3

In [297]:
df.apply(lambda x: len(str(x)))

Company       124
Department     95
Person        123
Age            87
Sales          97
dtype: int64

In [298]:
df.Company.map(lambda x: len(str(x)))

0    6
1    6
2    6
3    6
4    6
5    6
6    6
7    6
Name: Company, dtype: int64

In [299]:
df_num.applymap(np.sum) # hiç birşey değişmedi çünkü her elemana tek tek uyguladı

   Age  Sales
0   32    180
1   26    160
2   35    150
3   40    180
4   25    240
5   38    200
6   30    220
7   28    160

In [300]:
df_num.apply(np.sum) # sütun bazında çalıştığı için. age lerin toplamanı verdi

Age       254
Sales    1490
dtype: int64

## apply - transform farkı

In [301]:
df_num.apply(np.sum, axis=1) # satıları topladık. mantıklı değil ama kullanılabiliyor

0    212
1    186
2    185
3    220
4    265
5    238
6    250
7    188
dtype: int64

In [302]:
df.groupby("Company").transform(np.mean)

     Age  Sales
0  28.25  200.0
1  28.25  200.0
2  35.25  172.5
3  35.25  172.5
4  28.25  200.0
5  35.25  172.5
6  28.25  200.0
7  35.25  172.5

In [303]:
df.groupby("Company").apply(np.mean)

           Age  Sales
Company
Amazon   28.25  200.0
OpenAI   35.25  172.5

In [304]:
df.Person

0     Ahmet
1       Ece
2     Fatma
3    Mehmet
4    Zeynep
5       Ali
6     Yusuf
7      Elif
Name: Person, dtype: object

In [305]:
df.Person.map({"Ahmet": "A", "Ece": "E"})

0      A
1      E
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
Name: Person, dtype: object

In [306]:
df

  Company Department  Person  Age  Sales
0  Amazon         IT   Ahmet   32    180
1  Amazon         HR     Ece   26    160
2  OpenAI         IT   Fatma   35    150
3  OpenAI         HR  Mehmet   40    180
4  Amazon         IT  Zeynep   25    240
5  OpenAI         HR     Ali   38    200
6  Amazon         HR   Yusuf   30    220
7  OpenAI         IT    Elif   28    160

In [307]:
df.Department.map({"IT": 0, "HR": 1})

0    0
1    1
2    0
3    1
4    0
5    1
6    1
7    0
Name: Department, dtype: int64

In [308]:
df.Department = df.Department.map({"IT": 0, "HR": 1})
df

  Company  Department  Person  Age  Sales
0  Amazon           0   Ahmet   32    180
1  Amazon           1     Ece   26    160
2  OpenAI           0   Fatma   35    150
3  OpenAI           1  Mehmet   40    180
4  Amazon           0  Zeynep   25    240
5  OpenAI           1     Ali   38    200
6  Amazon           1   Yusuf   30    220
7  OpenAI           0    Elif   28    160

# .pivot() & .pivot_table()
pivot() fonksiyonu, bir DataFrame üzerinde tek bir indeks ve tek bir sütunu kullanarak veri dönüşümü yapar. İlk parametre olarak kullanılan DataFrame'i belirtir ve ardından index, columns ve values parametrelerini kullanarak pivot tablosunun nasıl oluşturulacağını belirleyebiliriz. pivot() fonksiyonu, herhangi bir hesaplama yapmadan sadece verileri yeniden düzenler.

pivot_table() fonksiyonu ise bir DataFrame üzerinde gruplama ve dönüşüm işlemleri yapar. pivot_table() fonksiyonu, daha karmaşık işlemler yapmamıza olanak tanır ve özellikle toplama, ortalama, medyan, maksimum, minimum gibi istatistiksel hesaplamaları yapabiliriz. pivot_table() fonksiyonu, aggfunc parametresi ile hangi hesaplamanın yapılacağını belirleyebiliriz.

Her iki fonksiyon da, veriyi yeniden düzenleyerek farklı bir görünüm elde etmeyi sağlar. Yani, mevcut veriyi farklı bir düzenleme şekli ile sunar.

pivot_table() fonksiyonu, birden fazla indeks ve sütunu desteklerken, pivot() fonksiyonu yalnızca tek bir indeks ve sütunu kullanabilir.

pivot_table() fonksiyonu, eksik değerleri doldurma, çoklu değerlere sahip hücrelerde agregasyon yapma gibi daha gelişmiş dönüşüm ve manipülasyon seçenekleri sunar.

Her iki fonksiyon da, genellikle veri analitiği, raporlama ve veri görselleştirme süreçlerinde kullanılır ve veri setlerini farklı bakış açılarından incelemek için kullanılabilir.

pivot() ve pivot_table() fonksiyonları, pandas kütüphanesindeki güçlü veri dönüşüm ve analiz araçlarından sadece birkaçıdır ve veri manipülasyonunda oldukça kullanışlıdırlar.

In [309]:
data = {'gender':['male', 'female', 'female', 'male', 'female', 'male'],
        'sport':['tennis', 'tennis', 'basketball', 'football', 'voleyball', 'basketball'],
        'status':["professional","professional","professional","amateur","amateur","amateur"],
        'age':[20, 24, 26, 23, 22, 21],
        'height':[185, 172, 175, 178, 182, 196],
        'weight':[83, 58, 62, 80, 65, 90]}

df = pd.DataFrame(data)

df

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female  basketball  professional   26     175      62
3    male    football       amateur   23     178      80
4  female   voleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [310]:
df.pivot_table(index="gender", columns="sport", values=["age"], aggfunc="mean") # mean default tur

              age
sport  basketball football tennis voleyball
gender
female       26.0      NaN   24.0      22.0
male         21.0     23.0   20.0       NaN

In [311]:
df.pivot_table(index="gender", columns="sport", values=["age", "weight", "height"])

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0      175.0      NaN  172.0
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0       62.0      NaN   58.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [312]:
df.pivot(index="gender", columns="sport", values=["age", "weight", "height"]) # deplicate olmadığı için aynı şeyi verdi

              age                               weight                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0       62.0      NaN   58.0
male         21.0     23.0   20.0       NaN       90.0     80.0   83.0

                     height
sport  voleyball basketball football tennis voleyball
gender
female      65.0      175.0      NaN  172.0     182.0
male         NaN      196.0    178.0  185.0       NaN

In [313]:
df

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female  basketball  professional   26     175      62
3    male    football       amateur   23     178      80
4  female   voleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [314]:
df.pivot_table(index= "gender", columns="sport", values= "status") 
# default aggfunc="mean" olduğu için str lere çalışamaz

Empty DataFrame
Columns: []
Index: [female, male]

In [315]:
df.pivot(index="gender", columns="sport", values="status")
# duplicate olmadığı için. str lerle çalışırken bunu tercih edebiliriz

sport     basketball football        tennis voleyball
gender
female  professional      NaN  professional   amateur
male         amateur  amateur  professional       NaN

In [316]:
df.loc[2, "sport"] = "tennis"
df

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female      tennis  professional   26     175      62
3    male    football       amateur   23     178      80
4  female   voleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [317]:
df.pivot_table(index="gender", columns="sport", values=["age", "weight", "height"])

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female        NaN      NaN   25.0      22.0        NaN      NaN  173.5
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0        NaN      NaN   60.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [318]:
# df.pivot(index="gender", columns="sport", values=["age", "weight", "height"]) 
# duplicate veriler olduğu için çalışmadı